{
"stars": "Stars",
"quasars": "Quasars",
"planets": "Planets",
"blackHoles": "BlackHoles",
"galaxy": "Galaxy",
"nebulae": "Nebulae",
"Mercury": "Mercury",
"Venus": "Venus",
"Earth": "Earth",
"Mars": "Mars",
"Jupiter": "Jupiter",
"Saturn": "Saturn",
"Uranus": "Uranus",
"Neptune": "Neptune",

"stars_desc": "Star is a spherical collection of gases that hold their shape due to their own gravity, and are also capable of emitting light",
"quasars_desc": "Quasars are a class of extragalactic objects characterized by a very high luminosity and such a small angular size",
"planets_desc": "A planet is a celestial body that moves around a star, has a significant mass and is close to a spherical shape.",
"blackHoles_desc": "Black holes are a region of space-time, the gravitational attraction of which is so strong that even objects moving at the speed of light, including quanta of light itself, cannot leave it.",
"galaxy_desc": "A galaxy is a gravitationally bound system of stars, star clusters, interstellar gas and dust, dark matter, and planets.",
"nebulae_desc": "A nebula is a region of the interstellar medium that stands out by its radiation or absorption of radiation against the general background of the sky.",
"diametre_of_planet": "The Planet Diametre is",
"light-years": "light-years",
"Dark Mode": "Dark Mode",
"There are 8 Planets of the Solar system": "There are 8 Planets of the Solar system",
"km": "km",
"arcseconds": "arcseconds",
"million": "million",
"billion": "billion",
"kilometres": "kilometres",
"sunMass": "mass of sun",
"Solar System": "Solar System",
"uY_scuti_desc": "UY Scuti (BD-12°5055) is an extreme red hypergiant[3] or red supergiant star in the constellation Scutum. It is considered one of the largest known stars by radius and is also a pulsating variable star, with a maximum brightness of magnitude 8.29 and a minimum of magnitude 10.56. It has an estimated radius of 1,708 solar radii (1.188×109 kilometres; 7.94 astronomical units), thus a volume nearly 5 billion times that of the Sun. It is approximately 2.9 kiloparsecs (9,500 light-years) from Earth. If placed at the center of the Solar System, its photosphere would at least engulf the orbit of Jupiter.UY Scuti was first catalogued in 1860 by German astronomers at the Bonn Observatory, who were completing a survey of stars for the Bonner Durchmusterung Stellar Catalogue.[12] It was designated BD-12°5055, the 5,055th star between 12°S and 13°S counting from 0h right ascension. On detection in the second survey, the star was found to have changed slightly in brightness, suggesting that it was a new variable star. In accordance with the international standard for designation of variable stars, it was called UY Scuti, denoting it as the 38th variable star of the constellation Scutum.[13] UY Scuti is located a few degrees north of the A-type star Gamma Scuti and northeast of the Eagle Nebula. Although the star is very luminous, it is, at its brightest, only 9th magnitude as viewed from Earth, due to its distance and location in the Zone of Avoidance within the Cygnus rift.UY Scuti is a dust-enshrouded bright red supergiant[15] and is classified as a semiregular variable with an approximate pulsation period of 740 days.[6][16][17] Based on a radius of 1,708 R☉, this pulsation would be an overtone of the fundamental pulsation period, or it may be a fundamental mode corresponding to a smaller radius.[18] In the summer of 2012, AMBER interferometry with the Very Large Telescope (VLT) in the Atacama Desert in Chile was used to measure the parameters of three red supergiants near the Galactic Center region:[4] UY Scuti, AH Scorpii, and KW Sagittarii. They determined that all three stars are over 1,000 times bigger than the Sun and over 100,000 times more luminous than the Sun. The stars' sizes were calculated using the Rosseland radius, the location at which the optical depth is 2⁄3,[19] with distances adopted from earlier publications. UY Scuti was found to be the largest and the most luminous of the three stars measured, at 1,708 ± 192 R☉ (1.188×109 ± 134,000,000 km; 7.94 ± 0.89 AU) based on an angular diameter of 5.48±0.10 mas and an assumed distance of 2.9±0.317 kiloparsecs (kpc) (about 9,500±1,030 light-years) which was originally derived in 1970 based on the modelling of the spectrum of UY Scuti.[10] The luminosity is then calculated to be 340,000 L☉ at an effective temperature of 3,365 ± 134 K, giving an initial mass of 25 M☉ (possibly up to 40 M☉ for a non-rotating star).[4] A hypothetical object travelling at the speed of light would be observed to take about seven hours to travel along UY Scuti's great circle whereas it would take 14.5 seconds to circle the Sun.[20] Direct measurements of the parallax of UY Scuti published in the Gaia Data Release 2 give a parallax of 0.6433±0.1059 mas,[7] implying a closer distance of approximately 1.5 kiloparsecs (4,900 ly),[21] and consequently much lower luminosity and radius values of around 86,300–87,100 L☉ and 755 R☉ respectively.[22] However, the Gaia parallax might be unreliable, at least until further observations, due to a very high level of astrometric noise.[7] Gaia Early Data Release 3 has published a parallax of 0.5166±0.0494 mas for this star, again with a large value for astrometric noise, rated at a significance of 122 where anything over 2 is probably significant.[9]UY Scuti has no known companion star and so its mass is uncertain. However, it is expected on theoretical grounds to be between 7 and 10 M☉.[4] Mass is being lost at 5.8×10−5 M☉ per year, leading to an extensive and complex circumstellar environment of gas and dust.[23]",
"stephenson_desc": "Stephenson 2 DFK 1 (abbreviated to RSGC2-01),[b] also known as Stephenson 2-18 (abbreviated to St2-18), is an enigmatic[8] red supergiant (RSG) or possible extreme red hypergiant[2] (RHG) star in the constellation of Scutum. It lies near the open cluster Stephenson 2, which is located about 5.8 kiloparsecs (19,000 light-years) away from Earth in the Scutum–Centaurus Arm of the Milky Way galaxy, and is assumed to be one of a group of stars at a similar distance, although some studies consider it to be an unrelated or foreground red supergiant.[5][6] It is among the largest known stars, one of the most luminous red supergiants, and one of the most luminous stars in the Milky Way.Stephenson 2 DFK 1 has an estimated radius of around 2,150 solar radii (1.50×109 kilometres; 10.0 astronomical units), which would correspond to a volume nearly 10 billion times that of the Sun. Taking this estimate as correct, it would take nearly 9 hours to travel around its surface at the speed of light, compared to 14.5 seconds for the Sun.[9] If placed at the center of Earth's Solar System, its photosphere would engulf the orbit of Saturn. The open cluster Stephenson 2 was discovered by American astronomer Charles Bruce Stephenson in 1990 in the data obtained by a deep infrared survey.[2][10] The cluster is also known as RSGC2, one of several massive open clusters in Scutum, each containing multiple red supergiants.[11] The brightest star in the region of the cluster was given the identifier 1 in the first analysis of cluster member properties. However, it was not considered to be a member of Stephenson 2 due to its outlying position, abnormally high brightness, and slightly atypical proper motion, instead being categorized as an unrelated red supergiant.[2] In a later study, the same star was given the number 18 and assigned to an outlying group of stars called Stephenson 2 SW, assumed to be at a similar distance to the core cluster.[8] The designation St2-18 (short for Stephenson 2-18) is often used for the star, following the numbering from Deguchi (2010).[7][8] To avoid confusion from using the same number for different stars and different numbers for the same star, designations from Davies (2007) are often given a prefix of DFK or D,[11] for example Stephenson 2 DFK 1 or simply D1 where the context is clear.[5] In 2012, Stephenson 2 DFK 1, along with 56 other red supergiants, was observed in a study regarding the maser emissions from red supergiants across the galaxy. The study derived the properties of those red supergiants using the Australia Telescope Compact Array (ATCA) and the DUSTY model. Stephenson 2 DFK 1 was among the red supergiants mentioned.[7] That same year, it was observed again for a study regarding the types of masers on red supergiant stars in clusters. [5] During 2013, in a study regarding the red supergiants in Stephenson 2, Stephenson 2 DFK 1 (referred to as D1) was observed.[3] In several later studies, the star was described as being a very late-type red supergiant.[12][6] It was also noted in Humphreys et al. (2020), albeit mistakenly referred to as RSGC1-01, another very large and luminous red supergiant in the constellation of Scutum.[6] When the cluster was originally discovered in 1990, Stephenson 2, and therefore Stephenson 2 DFK 1, was originally estimated to have a distance of around 30 kiloparsecs (98,000 light-years), much further than the cluster is thought to reside today.[10] A study in 2007 determined a kinematic distance of 5.83+1.91 −0.78 kiloparsecs (19000+6200−2500 light-years) from comparison with the cluster's radial velocity, considerably closer than the original distance quoted by Stephenson (1990).[2] However, because of Stephenson 2 DFK 1's doubtful membership, its distance was not directly estimated. This value was later adopted in a recent study of the cluster.[6] A similar kinematic distance of 5.5 kiloparsecs (18,000 light-years) was reported in a 2010 study, derived from the average radial velocity of four of the cluster's members (96 kilometers per second) and from an association with a clump of stars near Stephenson 2, Stephenson 2 SW, locating it near the Scutum–Centaurus Arm of the Milky Way.[8] This value was later adopted in a 2012 study to calculate the star's luminosity. It is noted that the uncertainty in the distance was greater than 50%. Despite this, it is also stated that distances to massive star clusters will be improved in the future.[7] Verheyen et al. (2013) used the average radial velocity of the cluster (+109.3 ± 0.7 kilometers per second) to derive a kinematic distance of roughly 6 kiloparsecs (20,000 light-years) for the cluster. However, Stephenson 2 DFK 1's radial velocity is calculated to be only 89 kilometers per second and therefore leading to the study's statement that the star is a field red supergiant unassociated with the cluster.[5]",
"sirius_desc": "Sirius is the brightest star in the night sky. Its name is derived from the Greek word Σείριος, or Seirios, meaning lit. 'glowing' or 'scorching'. The star is designated α Canis Majoris, Latinized to Alpha Canis Majoris, and abbreviated α CMa or Alpha CMa. With a visual apparent magnitude of −1.46, Sirius is almost twice as bright as Canopus, the next brightest star. Sirius is a binary star consisting of a main-sequence star of spectral type A0 or A1, termed Sirius A, and a faint white dwarf companion of spectral type DA2, termed Sirius B. The distance between the two varies between 8.2 and 31.5 astronomical units as they orbit every 50 years.[25] Sirius appears bright because of its intrinsic luminosity and its proximity to the Solar System. At a distance of 2.64 parsecs (8.6 ly), the Sirius system is one of Earth's nearest neighbours. Sirius is gradually moving closer to the Solar System; it is expected to increase in brightness slightly over the next 60,000 years to reach a peak magnitude of −1.68. Coincidentally, at about the same time, Sirius will take its turn as the southern Pole Star, around the year 66270. In that year, Sirius will come to within 1.6 degrees of the south celestial pole. This is due to precession and proper motion of Sirius itself which moves slowly in the SSW direction. So it will be visible from the southern hemisphere only. [26] After that time, its distance will begin to increase, and it will become fainter, but it will continue to be the brightest star in the Earth's night sky for approximately the next 210,000 years, at which point Vega, another A-type star that is intrinsically more luminous than Sirius, becomes the brightest star.[27] Sirius A is about twice as massive as the Sun (M☉) and has an absolute visual magnitude of +1.43. It is 25 times as luminous as the Sun,[13] but has a significantly lower luminosity than other bright stars such as Canopus, Betelgeuse, or Rigel. The system is between 200 and 300 million years old.[13] It was originally composed of two bright bluish stars. The initially more massive of these, Sirius B, consumed its hydrogen fuel and became a red giant before shedding its outer layers and collapsing into its current state as a white dwarf around 120 million years ago.[13] Sirius is colloquially known as the Dog Star, reflecting its prominence in its constellation, Canis Major (the Greater Dog).[19] The heliacal rising of Sirius marked the flooding of the Nile in Ancient Egypt and the dog days of summer for the ancient Greeks, while to the Polynesians, mostly in the Southern Hemisphere, the star marked winter and was an important reference for their navigation around the Pacific Ocean. n his 1698 book, Cosmotheoros, Christiaan Huygens estimated the distance to Sirius at 27,664 times the distance from the Earth to the Sun (about 0.437 light-year, translating to a parallax of roughly 7.5 arcseconds).[42] There were several unsuccessful attempts to measure the parallax of Sirius: by Jacques Cassini (6 seconds); by some astronomers (including Nevil Maskelyne)[43] using Lacaille's observations made at the Cape of Good Hope (4 seconds); by Piazzi (the same amount); using Lacaille's observations made at Paris, more numerous and certain than those made at the Cape (no sensible parallax); by Bessel (no sensible parallax).[44] Scottish astronomer Thomas Henderson used his observations made in 1832–1833 and South African astronomer Thomas Maclear's observations made in 1836–1837, to determine that the value of the parallax was 0.23 arcsecond, and error of the parallax was estimated not to exceed a quarter of a second, or as Henderson wrote in 1839, On the whole we may conclude that the parallax of Sirius is not greater than half a second in space; and that it is probably much less.[45] Astronomers adopted a value of 0.25 arcsecond for much of the 19th century.[46] It is now known to have a parallax of nearly 0.4 arcseconds.The Hipparcos parallax for Sirius is only accurate to about ±0.04 light years, giving a distance of 8.6 light years.[9] Sirius B is generally assumed to be at the same distance. Sirius B has a Gaia Data Release 3 parallax with a much smaller statistical margin of error, giving a distance of 8.709±0.005 light years, but it is flagged as having a very large value for astrometric excess noise, which indicates that the parallax value may be unreliable.[1",
"mercury_desc": "Mercury is the first planet from the Sun and the smallest planet in the Solar System. It is a terrestrial planet with a heavily cratered surface due to the planet having no geological activity and an extremely tenuous atmosphere (called an exosphere). Despite being the smallest planet in the Solar System with a mean diameter of 4,880 km (3,030 mi), 38% of that of Earth's, Mercury is dense enough to have roughly the same surface gravity as Mars. Mercury has a dynamic magnetic field with a strength about 1% of that of Earth's and has no natural satellites.According to current theories, Mercury may have a solid silicate crust and mantle overlying a solid outer core, a deeper liquid core layer, and a solid inner core. Having almost no atmosphere to retain heat, Mercury has surface temperatures that change wildly during the day, ranging from 100 K (−173 °C; −280 °F) at night to 700 K (427 °C; 800 °F) during sunlight across the equator regions.[19] At Mercury's poles though, there are large reservoirs of water ices that are never exposed to direct sunlight, which has an estimated mass of about 0.025–0.25% the Antarctic ice sheet.[20] There are many competing hypotheses about Mercury's origins and development, some of which incorporate collision with planetesimal and rock vaporization. Because Mercury is very close to the Sun, the intensity of sunlight on its surface is between 4.59 and 10.61 times the solar constant (amount of the Sun's energy received at 1 astronomical unit, which is roughly the distance between Earth and the Sun). Mercury orbits the Sun in a 3:2 spin–orbit resonance, meaning that relative to the background stars, it rotates on its axis exactly three times for every two revolutions it makes around the Sun.[a][21] Counterintuitively, due to Mercury's slow rotation, an observer on the planet would see only one Mercurian solar day (176 Earth days) every two Mercurian solar years (88 Earth days each).[4] Mercury's axis has the smallest tilt of any of the Solar System's planets (about 1⁄30 of a degree), and its orbital eccentricity is the largest of all known planets in the Solar System.[b] Like Venus, Mercury orbits the Sun within Earth's orbit, making it appear in Earth's sky only as a morning star or evening star that's relatively close to the Sun. In English, it is named after the Roman god Mercurius (Mercury), god of commerce, communication and the messenger of gods. Mercury is the most difficult planet to reach from Earth because it requires the greatest change in spacecraft's velocity. Only two spacecraft have visited Mercury as of 2023: Mariner 10 flew by in 1974 and 1975, and MESSENGER launched in 2004 and orbited Mercury over 4,000 times in four years. The BepiColombo spacecraft is scheduled to make its final arrival at Mercury in 2025, and will then insert two orbiters.",
"venus_desc": "Venus is the second planet from the Sun. It is a rocky planet with the densest atmosphere of all the rocky bodies in the Solar System, and the only one with a mass and size that is close to that of its orbital neighbour Earth. Orbiting inferiorly (inside of Earth's orbit), it appears in Earth's sky always close to the Sun, as either a morning star or an evening star. While this is also true for Mercury, Venus appears much more prominently, since it is the third brightest object in Earth's sky after the Moon and the Sun,[20][21] appearing brighter than any other star-like classical planet or any fixed star. With such a prominence in Earth's sky, Venus has historically been a common and important object for humans, in both their cultures and astronomy. Venus has a weak induced magnetosphere and an especially thick carbon dioxide atmosphere, which creates, together with its global sulfuric acid cloud cover, an extreme greenhouse effect. This results at the surface in a mean temperature of 737 K (464 °C; 867 °F) and a crushing pressure of 92 times that of Earth's at sea level, turning the air into a supercritical fluid, while at cloudy altitudes of 50 km (30 mi) above the surface, the pressure, temperature and also radiation are very much like at Earth's surface. Conditions possibly favourable for life on Venus have been identified at its cloud layers, with recent research having found indicative, but not convincing, evidence of life on the planet. Venus may have had liquid surface water early in its history, possibly enough to form oceans, but runaway greenhouse effects eventually evaporated any water, which then was taken into space by the solar wind.[22][23][24] Internally, Venus is thought to consist of a core, mantle, and crust, the latter releasing internal heat through its active volcanism, shaping the surface with large resurfacing instead of plate tectonics. Venus is one of two planets in the Solar System which have no moons.[25] Venus has a rotation which has been slowed and turned against its orbital direction (retrograde) by the strong currents and drag of its atmosphere. This rotation produces, together with the time of 224.7 Earth days it takes Venus to complete an orbit around the Sun (a Venusian solar year), a Venusian solar day length of 117 Earth days, the longest in the Solar System, resulting in a Venusian year being just under two Venusian days long. The orbits of Venus and Earth are the closest between any two Solar System planets, approaching each other in synodic periods of 1.6 years. While this allows them to come closer to each other at inferior conjunction than any other pair of Solar System planets, Mercury stays on average closer to them and any other planet, as Mercury is the most central planet and passes by most frequently.[26] That said, Venus and Earth have between them the lowest difference in gravitational potential than any other pair of Solar System planets. This has allowed Venus to be the most accessible destination and attractive gravity assist waypoint for interplanetary flights. In 1961, Venus became the target of the first interplanetary flight in human history, followed by many essential interplanetary firsts like the first soft landing on another planet in 1970. These probes made it evident that extreme greenhouse effects have created oppressive surface conditions, an insight that has crucially informed predictions about global warming on Earth.[27][28] This finding stopped most attention towards theories and the then popular science fiction about Venus being a habitable or inhabited planet. Crewed flights to Venus have been suggested nevertheless, either to flyby Venus, performing a gravity assist for reaching Mars faster and safer, or to enter the Venusian atmosphere and stay aloft at altitudes with conditions more compareable to Earth's surface, except atmospheric composition, than anywhere else in the Solar System. Contemporarily Venus has again gained interest as a case for research into particularly the development of Earth-like planets and their habitability.", 
"earth_desc": "Earth is the third planet from the Sun and the only astronomical object known where life developed and found habitability. This is enabled by Earth being a water world, the only one in the Solar System sustaining liquid surface water. Almost all of Earth's water is contained in its global ocean, spanning 70.8% of Earth's surface. The remaining 29.2% of Earth's surface is land, most of which is located in the form of continental landmasses within one hemisphere, Earth's land hemisphere. Most of Earth's land is somewhat humid and covered by vegetation, while large sheets of ice at Earth's polar deserts retain more water than Earth's groundwater, lakes, rivers and atmospheric water together. Earth's land is part of Earth's crust, consisting of several slowly moving tectonic plates, which interact to produce mountain ranges, volcanoes, and earthquakes. Inside Earth's crust is a liquid outer core that generates the magnetosphere, deflecting most of the destructive solar winds and cosmic radiation. Earth has a dynamic atmosphere, which sustains Earth's surface conditions and protects it from most meteoroids and UV-light at entry. It has a composition of primarily nitrogen and oxygen. Water vapor is widely present in the atmosphere, forming clouds that cover most of the planet. The water vapor acts as a greenhouse gas and, together with other greenhouse gases in the atmosphere, particularly carbon dioxide (CO2), creates the conditions for both liquid surface water and water vapor to persist via the capturing of energy from the Sun's light. This process maintains the current average surface temperature of 14.76 °C, at which water is liquid under atmospheric pressure. Differences in the amount of captured energy between geographic regions (as with the equatorial region receiving more sunlight than the polar regions) drive atmospheric and ocean currents, producing a global climate system with different climate regions, and a range of weather phenomena such as precipitation, allowing components such as nitrogen to cycle. Earth is rounded into an ellipsoid with a circumference of about 40,000 km. It is the densest planet in the Solar System. Of the four rocky planets, it is the largest and most massive. Earth is about eight light-minutes away from the Sun and orbits it, taking a year (about 365.25 days) to complete one revolution. Earth rotates around its own axis in slightly less than a day (in about 23 hours and 56 minutes). Earth's axis of rotation is tilted with respect to the perpendicular to its orbital plane around the Sun, producing seasons. Earth is orbited by one permanent natural satellite, the Moon, which orbits Earth at 384,400 km (1.28 light seconds) and is roughly a quarter as wide as Earth. Through tidal locking, the Moon always faces Earth with the same side, which causes tides, stabilizes Earth's axis, and gradually slows its rotation. Earth, like most other bodies in the Solar System, formed 4.5 billion years ago from gas in the early Solar System. During the first billion years of Earth's history, the ocean formed and then life developed within it. Life spread globally and has been altering Earth's atmosphere and surface, leading to the Great Oxidation Event two billion years ago. Humans emerged 300,000 years ago in Africa and have spread across every continent on Earth with the exception of Antarctica. Humans depend on Earth's biosphere and natural resources for their survival, but have increasingly impacted the planet's environment. Humanity's current impact on Earth's climate and biosphere is unsustainable, threatening the livelihood of humans and many other forms of life, and causing widespread extinctions.[24]",
"mars_desc": "Mars is the fourth planet and the furthest terrestrial planet from the Sun. The reddish color of its surface is due to finely grained iron(III) oxide dust in the soil, giving it the nickname the Red Planet.[21][22] Mars's radius is second smallest among the planets in the Solar System at 3,389.5 km (2,106 mi). The Martian dichotomy is visible on the surface: on average, the terrain on Mars's northern hemisphere is flatter and lower than its southern hemisphere. Mars has a thin atmosphere made primarily of carbon dioxide and two irregularly shaped natural satellites: Phobos and Deimos. Geologically, Mars is fairly active, with dust devils sweeping across the landscape and marsquakes (Martian analog to earthquakes) trembling underneath the ground. The surface of Mars hosts a large shield volcano (Olympus Mons) and one of the largest canyons in the Solar System (Valles Marineris). Mars's significant orbital eccentricity and axial tilt cause large seasonal changes to the polar ice caps' coverage and temperature swings between −110 °C (−166 °F) to 35 °C (95 °F) on the surface. A Martian solar day (sol) is equal to 24.5 hours and a Martian solar year is equal to 1.88 Earth years. Like the other planets in the Solar System, Mars was formed approximately 4.5 billion years ago. During the Noachian period from about 4.1 to 3.7 billion years ago, Mars's surface was marked by meteor impacts, valley formation, erosion, and the possible presence of water oceans. The Hesperian period from 3.7 to 3.2–2 billion years ago was dominated by widespread volcanic activity and flooding that carved immense outflow channels. The Amazonian period, which continues to the present, was marked by the wind's influence on geological processes. It is unknown whether life has ever existed on Mars. Mars is among the brightest objects in Earth's sky, and thus has been known from the ancient times. Its high-contrast albedo features make it a common subject for viewing with a telescope. Since the late 20th century, Mars has been explored by uncrewed spacecraft and rovers, with the first flyby by the Mariner 4 probe in 1965, the first Mars orbiter by the Mars 2 probe in 1971, and the first landing by Viking 1 in 1976. As of 2023, there are at least 11 active probes orbiting Mars or at the Martian surface. Currently, Mars is an attractive target for the first future interplanetary human missions.",
"jupiter_desc": "Jupiter is the fifth planet from the Sun and the largest in the Solar System. It is a gas giant with a mass more than two and a half times that of all the other planets in the Solar System combined, and slightly less than one one-thousandth the mass of the Sun. Jupiter is the third brightest natural object in the Earth's night sky after the Moon and Venus, and it has been observed since prehistoric times. It was named after Jupiter, the chief deity of ancient Roman religion. Jupiter is primarily composed of hydrogen (90% by volume), followed by helium, which constitutes a quarter of its mass and a tenth of its volume. The ongoing contraction of Jupiter's interior generates more heat than the planet receives from the Sun. Because of its rapid rotation rate of 1 rotation per 10 hours, the planet's shape is an oblate spheroid: it has a slight but noticeable bulge around the equator. The outer atmosphere is divided into a series of latitudinal bands, with turbulence and storms along their interacting boundaries. The most obvious result of this is the Great Red Spot, a giant storm which has been observed since 1831 and possibly earlier. Jupiter is surrounded by a faint planetary ring system and has a powerful magnetosphere, the largest contiguous structure in the Solar System after the heliosphere. Jupiter forms a system of 95 known moons and probably many more, including the four large moons discovered by Galileo Galilei in 1610: Io, Europa, Ganymede, and Callisto. Ganymede, the largest of the four, is larger than the planet Mercury. Callisto is the second largest; Io and Europa are approximately the size of Earth's Moon. Since 1973, Jupiter has been visited by nine robotic probes: seven flybys and two dedicated orbiters, with two more either en route or awaiting launch.",
"saturn_desc": "Saturn is the sixth planet from the Sun and the second-largest in the Solar System, after Jupiter. It is a gas giant with an average radius of about nine and a half times that of Earth.[26][27] It has only one-eighth the average density of Earth, but is over 95 times more massive.[28][29][30] Saturn's interior is thought to be composed of a rocky core, surrounded by a deep layer of metallic hydrogen, an intermediate layer of liquid hydrogen and liquid helium, and finally, a gaseous outer layer. Saturn has a pale yellow hue due to ammonia crystals in its upper atmosphere. An electrical current within the metallic hydrogen layer is thought to give rise to Saturn's planetary magnetic field, which is weaker than Earth's, but which has a magnetic moment 580 times that of Earth due to Saturn's larger size. Saturn's magnetic field strength is around one-twentieth of Jupiter's.[31] The outer atmosphere is generally bland and lacking in contrast, although long-lived features can appear. Wind speeds on Saturn can reach 1,800 kilometres per hour (1,100 miles per hour). The planet has a prominent ring system, which is composed mainly of ice particles, with a smaller amount of rocky debris and dust. At least 146 moons[32] are known to orbit the planet, of which 63 are officially named; this does not include the hundreds of moonlets in its rings. Titan, Saturn's largest moon and the second largest in the Solar System, is larger (while less massive) than the planet Mercury and is the only moon in the Solar System to have a substantial atmosphere.[33]",
"uranus_desc": "Uranus is the seventh planet from the Sun and is a gaseous cyan ice giant. Most of the planet is made out of water, ammonia, and methane in a supercritical phase of matter, which in astronomy is called 'ice' or volatiles. The planet's atmosphere has a complex layered cloud structure and has the lowest minimum temperature of 49 K (−224 °C; −371 °F) out of all Solar System's planets. It has a marked axial tilt of 97.8° with a retrograde rotation rate of 17 hours. This means that in an 84 Earth years orbital period around the Sun, its poles get around 42 years of continuous sunlight, followed by 42 years of continuous darkness. Uranus has the third-largest diameter and fourth-largest mass among the Solar System's planets. Based on current models, inside its volatile mantle layer is a rocky core, and surrounding it is a thick hydrogen and helium atmosphere. Trace amount of hydrocarbons (thought to be produced via hydrolysis) and carbon monoxide along with carbon dioxide (thought to have been originated from comets) have been detected in the upper atmosphere. There are many unexplained climate phenomena in Uranus's atmosphere, such as its peak wind speed of 900 km/h (560 mph),[22] variations in its polar cap and its erratic cloud formation. The planet also has a very low internal heat compared to other giant planets, which is still unexplained. Like the other giant planets, Uranus has a ring system, orbiting natural satellites and a magnetosphere. Its ring system is extremely dark, with only about 2% of the incoming light reflected, and contains the known 13 inner moons. Further out are the larger five major moons of the planet: Miranda, Ariel, Umbriel, Titania, and Oberon; and orbiting at much greater distance from Uranus are the known nine irregular moons. The planet's magnetosphere is highly asymmetric and has many charged particles, which may cause the darkening of its rings and moons. Uranus is visible to the naked eye, but it is very dim and was not classified as a planet until 1781, when it was first observed by William Herschel. About seven decades after its discovery, consensus was reached that the planet be named from the Greek god Uranus (Ouranos), one of the Greek primordial deities. As of 2023, it was visited up close only one time when in 1986 the Voyager 2 probe flew by the planet.[23] Though nowadays it can be resolved and observed by telescopes, there is much desire to revisit the planet, as shown by Planetary Science Decadal Survey's decision to make the proposed Uranus Orbiter and Probe mission a top priority in the 2023–2032 survey.",
"neptune_desc": "Neptune is the eighth planet from the Sun and the farthest IAU-recognized planet in the Solar System. It is the fourth-largest planet in the Solar System by diameter, the third-most-massive planet, and the densest giant planet. It is 17 times the mass of Earth, and slightly more massive than its near-twin Uranus. Neptune is denser and physically smaller than Uranus because its greater mass causes more gravitational compression of its atmosphere. Being composed primarily of gases and liquids, it has no well-defined solid surface. The planet orbits the Sun once every 164.8 years at an average distance of 30.1 astronomical units (4.5 billion kilometres; 2.8 billion miles). It is named after the Roman god of the sea and has the astronomical symbol ♆, representing Neptune's trident.[d] Neptune is not visible to the unaided eye and is the only planet in the Solar System found by mathematical prediction rather than by empirical observation. Unexpected changes in the orbit of Uranus led Alexis Bouvard to hypothesise that its orbit was subject to gravitational perturbation by an unknown planet. After Bouvard's death, the position of Neptune was predicted from his observations, independently, by John Couch Adams and Urbain Le Verrier. Neptune was subsequently observed with a telescope on 23 September 1846[1] by Johann Galle within a degree of the position predicted by Le Verrier. Its largest moon, Triton, was discovered shortly thereafter, though none of the planet's remaining 14 known moons were located telescopically until the 20th century. The planet's distance from Earth gives it a very small apparent size, making it challenging to study with Earth-based telescopes. Neptune was visited by Voyager 2, when it flew by the planet on 25 August 1989; Voyager 2 remains the only spacecraft to have visited Neptune.[18][19] The advent of the Hubble Space Telescope and large ground-based telescopes with adaptive optics has recently allowed for additional detailed observations from afar. Like the gas giants (Jupiter and Saturn), Neptune's atmosphere is composed primarily of hydrogen and helium, along with traces of hydrocarbons and possibly nitrogen, but contains a higher proportion of ices such as water, ammonia and methane. Similar to Uranus, its interior is primarily composed of ices and rock;[20] both planets are normally considered ice giants to distinguish them.[21] Along with Rayleigh scattering, traces of methane in the outermost regions in part account for the planet's blue appearance.[22] Newest data from the Gemini observatory shows the blue colour is more saturated than the one present on Uranus due to thinner haze of Neptune's more active atmosphere.[23][24][25] In contrast to the hazy, relatively featureless atmosphere of Uranus, Neptune's atmosphere has active and visible weather patterns. For example, at the time of the Voyager 2 flyby in 1989, the planet's southern hemisphere had a Great Dark Spot comparable to the Great Red Spot on Jupiter. More recently, in 2018, a newer main dark spot and smaller dark spot were identified and studied.[26] In addition, these weather patterns are driven by the strongest sustained winds of any planet in the Solar System, with recorded wind speeds as high as 2,100 km/h (580 m/s; 1,300 mph).[27] Because of its great distance from the Sun, Neptune's outer atmosphere is one of the coldest places in the Solar System, with temperatures at its cloud tops approaching 55 K (−218 °C; −361 °F). Temperatures at the planet's centre are approximately 5,400 K (5,100 °C; 9,300 °F).[28][29] Neptune has a faint and fragmented ring system (labelled arcs), which was discovered in 1984, then later confirmed by Voyager 2.[30]"
,"ulas_desc": "On 6 December 2017,[1] astronomers published that they had found the quasar using data from the Wide-field Infrared Survey Explorer (WISE)[6] combined with ground-based surveys from one of the Magellan Telescopes at Las Campanas Observatory in Chile, as well as the Large Binocular Telescope in Arizona and the Gemini North telescope in Hawaii.[8] The related black hole of the quasar existed when the universe was about 690 million years old (about 5 percent of its currently known age of 13.80 billion years).[1] The quasar comes from a time known as the epoch of reionization, when the universe emerged from its Dark Ages.[5] Extensive amounts of dust and gas have been detected to be released from the quasar into the interstellar medium of its host galaxy.[2] ULAS J1342+0928 has a measured redshift of 7.54, which corresponds to a comoving distance of 29.36 billion light-years from Earth.[1][4] When it was reported in 2017, it was the most distant quasar yet observed. The quasar emitted the light observed on Earth today less than 690 million years after the Big Bang, about 13.1 billion years ago.[5][9] The quasar's luminosity is estimated at 4×1013 solar luminosities.[1] This energy output is generated by a supermassive black hole estimated at 8×108 solar masses.[1] According to lead astronomer Bañados,[10] This particular quasar is so bright that it will become a gold mine for follow-up studies and will be a crucial laboratory to study the early universe.[5]"
,"3c_desc": "The name signifies that it was the 273rd object (ordered by right ascension) of the Third Cambridge Catalog of Radio Sources (3C), published in 1959. After accurate positions were obtained using lunar occultation by Cyril Hazard at the Parkes Radio Telescope,[17] the radio source was quickly associated with an optical counterpart, an unresolved stellar object. In 1963, Maarten Schmidt[7] and Bev Oke[18] published a pair of papers in Nature reporting that 3C 273 has a substantial redshift of 0.158, placing it several billion light-years away. Prior to the discovery of 3C 273, several other radio sources had been associated with optical counterparts, the first being 3C 48. Also, many active galaxies had been misidentified as variable stars, including the famous BL Lac, W Com and AU CVn. However, it was not understood what these objects were, since their spectra were unlike those of any known stars. Its spectrum did not resemble that of any normal stars with typical stellar elements. 3C 273 was the first object to be identified as a quasar—an extremely luminous object at an astronomical distance. 3C 273 is a radio-loud quasar, and was also one of the first extragalactic X-ray sources discovered in 1970. However, even to this day, the process which gives rise to the X-ray emissions is controversial.[4] "

}









